from jinja2 import Template

# from jinja2 import escape

# EXAMPLE 1 ##################################################################
# ЭКРАНИРОВАНИЕ ДАННЫХ В СТРОКАХ ##################################################################

# # Все что помещается внутри блока RAW не преобразуется
#
# data = '''{% raw %}Модуль Jinja вместо
# определения {{name}} подставляет
# соответствующее значение{% endraw %}'''
#
# tm = Template(data)
# msg = tm.render(name='Potter')
#
# # Вследствие экранирования имя Поттер не было подставлено
#
# print(msg)

# EXAMPLE 2 ##########################################################################################################
# ЭКРАНИРОВАНИЕ ТЕГОВ ###############################################№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№###################

# link = '''В HTML-документе ссылки определяются так:
# <a href="#">Ссылка</a>'''
#
# tm = Template(
#     "{{ link | e }}")  # В этом примере флаг e экранирует спецсимволы HTML и они представляются как обычный текст
# msg = tm.render(link=link)
#
# print(msg)

# EXAMPLE 3 ##########################################################################################################
# ЭКРАНИРОВАНИЕ ТЕГОВ С ПОМОЩЬЮ escape ###############################################№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№###################


# link = '''В HTML-документе ссылки определяются так:
# <a href="#">Ссылка</a>'''
#
# msg = escape(link)  # Модуль escape упрощает синтаксис - но конкретно в моем случае его почему-то не получается импортировать
# print(msg)


# EXAMPLE 4 ##########################################################################################################
# ИТЕРИРОВАНИЕ ЧЕРЕЗ БЛОК for ###############################################№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№###################

# Шаблон:
# {% for<выражение>-%}
#     <повторяемый фрагмент>
# {% endfor %}

# cities = [
#     {'id': 1, 'city': 'Jots'},
#     {'id': 5, 'city': 'Kaluga'},
#     {'id': 7, 'city': 'Orel'},
#     {'id': 81, 'city': 'Astana'},
#     {'id': 19, 'city': 'Bern'},
# ]
# # Символ - убирает перенос
# link = '''<select name = "cities">
# {% for c in cities -%}
#     <option value="{{c['id']}}">{{c['city']}}</option>
# {% endfor -%}
# </select>'''
#
# tm = Template(link)
# msg = tm.render(cities=cities)
#
# print(msg)


# EXAMPLE 5 ##########################################################################################################
# ВЫРАЖЕНИЕ if ###############################################№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№###################

# Шаблон:
# {% if<условие>%}
#     <фрагмент истинности условия>
# {% endif %}

cities = [
    {'id': 1, 'city': 'Jots'},
    {'id': 4, 'city': 'Kaluga'},
    {'id': 56, 'city': 'Orel'},
    {'id': 81, 'city': 'Astana'},
    {'id': 3, 'city': 'Bern'},
]
# Символ - убирает перенос
link = '''<select name = "cities">
{% for c in cities -%} 
{% if c.id > 6 -%} 
    <option value="{{c['id']}}">{{c['city']}}</option>
{% elif c.city == "Jots" -%}     
    <option {{c['id']}}</option>    
{%else -%}    
    {{c['city']}}
{% endif -%}
{% endfor -%}
</select>'''

tm = Template(link)
msg = tm.render(cities=cities)

print(msg)
